app/controllers/api/v1/books_controller.rb

SELECT "userroles".* FROM "userroles"
---
  def index

    # authorize Book
    # @books = @current_user.admin ? Book.all : @current_user.books
     @books = Userrole.all