app/controllers/api/v1/users_controller.rb

  def index
    authorize User
    @users = @current_user.admin ? User.all : [@current_user]
---
SELECT "users".* FROM "users"